{"review_id": "aOga0N5tsfa3UIjUL68K3Q", "user_id": "UT2qhTs4u9BC6V5W5lnKoQ", "business_id": "lE7rlU_kOvLhhOGFEutgVA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Worst Hooters experience ever. Lousy service, cold food, and you remain thirsty the entire time. I'm not even gonna get into the waitress' don't waist your time or money here.", "date": "2014-09-17 05:07:36"}
{"review_id": "T70ezvuqCDtSJDYK3z0OKg", "user_id": "YyzBNC_5aBhJi-aJWiEMvw", "business_id": "lE7rlU_kOvLhhOGFEutgVA", "stars": 3.0, "useful": 0, "funny": 1, "cool": 0, "text": "Considering how close this restaurant is to me (across the street), it's fairly obvious that this is my \"I'm drunk out of my tree and am too lazy to cook\" stop.  I've always wondered what I look like stumbling over to get some take-out.  \n\nI've never had bad service in this location, I'm happy to say.  It could be because of my natural good looks, unending charm or exciting personality.  Or it could just be because they know me and know I tip well.  \n\nI enjoy random things from their menu including their quesadillas, mozza sticks, chicken wings, and clubhouse to name a few.  There are a few dangers to avoid.  Their shrimp is a nono.  It's very rubbery and bland and makes me feel like a dog chewing on a tire in a trailer park.  Their \"gourmet\" hot dog has a microwaved taste to it and is very dry.  It would probably make a pretty good projectile, though, if somebody ticks you off to the point of earning a hot dog bullet.\n\nAll in all it's a pretty good place to hang out and have a brew, and being a guy, I can't complain about the servers or their attire either.", "date": "2012-03-18 22:05:40"}
{"review_id": "unSYjVKlRLzmETGPJ30BTw", "user_id": "FPTTIu-c_tmFLG2Jh0LbcQ", "business_id": "lE7rlU_kOvLhhOGFEutgVA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Waited an hour for cold food on a slow Saturday night and received flat beer. Will not being coming back again. Looking for wings, go to Studio 52. Looking to see boobs, go to the Maid. Looking for beer, go anywhere but here.", "date": "2013-01-13 07:43:43"}
{"review_id": "F_YdUsM_rZsJ6Bc4KZtyNg", "user_id": "j5xtbqfOYZbLFd2p8EGi5A", "business_id": "lE7rlU_kOvLhhOGFEutgVA", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great chicken and cold, fresh beer make stopping in at Hooters a festive occasion. I personally like their toasted ham and cheese sandwich. And the beer. Yes, the beer is good...\nAnyway, I've only been in a few times on Saturday afternoons when dead-beat dads get visitation hours with their sons and don't want to bother thinking up something fun the two of them can do together. So they bring them to Hooters. They even had a sign out front that advertised kids eat for free on weekends. This is sad....\nYeah, but me and my father had a good time anyway and watched the game over a few beers [joking].\nNo, I don't mind Hooters and their chicken is good. I wouldn't trust them to cook a fantastic, savoury meal, but I wouldn't trust a French restaurant to serve me good beer and wings. This location used to offer Flames ticket packages last year and I'll be looking into it this year. They also show a lot of rugby games here for some reason. Everyone has to go to Hooters at least once.....", "date": "2008-10-24 06:15:50"}
{"review_id": "0D1ssFM7dZhxDtolLz_60A", "user_id": "0xiX3PVkh2WoqZb423AcjA", "business_id": "lE7rlU_kOvLhhOGFEutgVA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "It basically looks like every other hooters out there. The wings are pretty good but again I'm not a huge pub fan. I think it's worth a try.", "date": "2011-04-11 05:40:45"}
{"review_id": "BpxOG5DJLPficP4ijgK3wg", "user_id": "7D7y8xZJ2H8rjXgjsL1-Cg", "business_id": "lE7rlU_kOvLhhOGFEutgVA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I can see why this place is dead on an NFL Sunday. Not enough tvs, tvs they do have are small, no HD channels, and the picture doesn't even got the whole tv. Too bad because I will always enjoy their buffalo chicken sandwich and deep fried pickles. But not a place to come watch sports and the atmosphere is poor.", "date": "2013-09-29 20:15:29"}
{"review_id": "d_gXhcpIggbSCXxcdhTxPw", "user_id": "Wse0ZccuS8bbI323pkLCuw", "business_id": "lE7rlU_kOvLhhOGFEutgVA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Does this location appeal to gay guys, because it often seems to have lots in there.  \n\nWondering.", "date": "2014-05-03 21:43:56"}
{"review_id": "JEu9T72sykW_2--Sk2t3_Q", "user_id": "U3Su5FLssAUKNYonpzIgRw", "business_id": "lE7rlU_kOvLhhOGFEutgVA", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I've been to a few Hooters in my day, and the one thing I marvel at is how alike they all are. No matter what province or country you're in, you know what you're gonna get - a casual atmosphere serving up tasty chicken wings, cold beer and a side of titillation thrown in for good measure. The Hooters on Macleod Trail delivers on all these fronts. It's a little on the bright side for my taste, but I suppose that's just to better display the chain's assets. The beautiful thing about the Hooters on Macleod is that they have a spacious patio overlooking the scenic parking lot of the Back Alley. Not the best of views, but outdoor drinkin' is outdoor drinkin', and besides, Hooters provides plenty to look at instead.", "date": "2010-05-01 03:09:09"}
